k6/out/logs-openfaas-default-1h-redis-glue.txt
time="2023-01-12T11:04:40Z" level=info msg=OK source=console
time="2023-01-12T12:04:40Z" level=info msg=OK source=console
time="2023-01-12T13:04:40Z" level=info msg=OK source=console
time="2023-01-12T14:04:40Z" level=info msg=OK source=console
time="2023-01-12T15:04:40Z" level=info msg=OK source=console
time="2023-01-12T16:04:40Z" level=info msg=OK source=console
time="2023-01-12T17:04:40Z" level=info msg=OK source=console
time="2023-01-12T18:04:40Z" level=info msg=OK source=console
time="2023-01-12T19:04:40Z" level=info msg=OK source=console
time="2023-01-12T20:04:40Z" level=info msg=OK source=console
time="2023-01-12T21:04:40Z" level=info msg=OK source=console
time="2023-01-12T22:04:40Z" level=info msg=OK source=console
time="2023-01-12T23:04:40Z" level=info msg=OK source=console
time="2023-01-13T00:04:40Z" level=info msg=OK source=console
time="2023-01-13T01:04:40Z" level=info msg=OK source=console
time="2023-01-13T02:04:40Z" level=info msg=OK source=console
time="2023-01-13T03:04:40Z" level=info msg=OK source=console
time="2023-01-13T04:04:40Z" level=info msg=OK source=console
time="2023-01-13T05:04:40Z" level=info msg=OK source=console
time="2023-01-13T06:04:40Z" level=info msg=OK source=console
time="2023-01-13T07:04:40Z" level=info msg=OK source=console
time="2023-01-13T08:04:40Z" level=info msg=OK source=console
time="2023-01-13T09:04:40Z" level=info msg=OK source=console
time="2023-01-13T10:04:40Z" level=info msg=OK source=console
time="2023-01-13T11:04:40Z" level=info msg=OK source=console
time="2023-01-13T12:04:40Z" level=info msg=OK source=console
time="2023-01-13T13:04:40Z" level=info msg=OK source=console
time="2023-01-13T14:04:40Z" level=info msg=OK source=console
time="2023-01-13T15:04:40Z" level=info msg=OK source=console
time="2023-01-13T16:04:40Z" level=info msg=OK source=console
time="2023-01-13T17:04:40Z" level=info msg=OK source=console
time="2023-01-13T18:04:40Z" level=info msg=OK source=console
time="2023-01-13T19:04:40Z" level=info msg=OK source=console
time="2023-01-13T20:04:40Z" level=info msg=OK source=console
time="2023-01-13T21:04:40Z" level=info msg=OK source=console
time="2023-01-13T22:04:40Z" level=info msg=OK source=console
time="2023-01-13T23:04:40Z" level=info msg=OK source=console
time="2023-01-14T00:04:40Z" level=info msg=OK source=console
time="2023-01-14T01:04:40Z" level=info msg=OK source=console
time="2023-01-14T02:04:40Z" level=info msg=OK source=console
time="2023-01-14T03:04:40Z" level=info msg=OK source=console
time="2023-01-14T04:04:40Z" level=info msg=OK source=console
time="2023-01-14T05:04:40Z" level=info msg=OK source=console
time="2023-01-14T06:04:40Z" level=info msg=OK source=console
time="2023-01-14T07:04:40Z" level=info msg=OK source=console
time="2023-01-14T08:04:40Z" level=info msg=OK source=console
time="2023-01-14T09:04:40Z" level=info msg=OK source=console
time="2023-01-14T10:04:40Z" level=info msg=OK source=console
time="2023-01-14T11:04:40Z" level=info msg=OK source=console
time="2023-01-14T12:04:40Z" level=info msg=OK source=console
time="2023-01-14T13:04:40Z" level=info msg=OK source=console
time="2023-01-14T14:04:40Z" level=info msg=OK source=console
time="2023-01-14T15:04:40Z" level=info msg=OK source=console
time="2023-01-14T16:04:40Z" level=info msg=OK source=console
time="2023-01-14T17:04:40Z" level=info msg=OK source=console
time="2023-01-14T18:04:40Z" level=info msg=OK source=console
time="2023-01-14T19:04:40Z" level=info msg=OK source=console
time="2023-01-14T20:04:40Z" level=info msg=OK source=console
time="2023-01-14T21:04:40Z" level=info msg=OK source=console
time="2023-01-14T22:04:40Z" level=info msg=OK source=console
time="2023-01-14T23:04:40Z" level=info msg=OK source=console
time="2023-01-15T00:04:40Z" level=info msg=OK source=console
time="2023-01-15T01:04:40Z" level=info msg=OK source=console
time="2023-01-15T02:04:40Z" level=info msg=OK source=console
time="2023-01-15T03:04:40Z" level=info msg=OK source=console
time="2023-01-15T04:04:40Z" level=info msg=OK source=console
time="2023-01-15T05:04:40Z" level=info msg=OK source=console
time="2023-01-15T06:04:40Z" level=info msg=OK source=console
time="2023-01-15T07:04:40Z" level=info msg=OK source=console
time="2023-01-15T08:04:40Z" level=info msg=OK source=console
time="2023-01-15T09:04:40Z" level=info msg=OK source=console
time="2023-01-15T10:04:40Z" level=info msg=OK source=console
time="2023-01-15T11:04:40Z" level=info msg=OK source=console
time="2023-01-15T12:04:40Z" level=info msg=OK source=console
time="2023-01-15T13:04:40Z" level=info msg=OK source=console
time="2023-01-15T14:04:40Z" level=info msg=OK source=console
time="2023-01-15T15:04:40Z" level=info msg=OK source=console
time="2023-01-15T16:04:40Z" level=info msg=OK source=console
time="2023-01-15T17:04:40Z" level=info msg=OK source=console
time="2023-01-15T18:04:40Z" level=info msg=OK source=console
time="2023-01-15T19:04:40Z" level=info msg=OK source=console
time="2023-01-15T20:04:40Z" level=info msg=OK source=console
time="2023-01-15T21:04:40Z" level=info msg=OK source=console
time="2023-01-15T22:04:40Z" level=info msg=OK source=console
time="2023-01-15T23:04:40Z" level=info msg=OK source=console
time="2023-01-16T00:04:40Z" level=info msg=OK source=console
time="2023-01-16T01:04:40Z" level=info msg=OK source=console
time="2023-01-16T02:04:40Z" level=info msg=OK source=console
time="2023-01-16T03:04:40Z" level=info msg=OK source=console
time="2023-01-16T04:04:40Z" level=info msg=OK source=console
time="2023-01-16T05:04:40Z" level=info msg=OK source=console
time="2023-01-16T06:04:40Z" level=info msg=OK source=console
time="2023-01-16T07:04:40Z" level=info msg=OK source=console
time="2023-01-16T08:04:40Z" level=info msg=OK source=console

     data_received..................: 24 kB 0.072430535559603 B/s
     data_sent......................: 30 kB 0.08985722923395081 B/s
     http_req_blocked...............: avg=12.46ms  min=4.75ms   med=11.46ms  max=40.57ms p(90)=16.43ms  p(95)=20.28ms
     http_req_connecting............: avg=1.05ms   min=379.73µs med=764.43µs max=10.95ms p(90)=1.03ms   p(95)=1.45ms 
     http_req_duration..............: avg=18.38ms  min=13.05ms  med=17.37ms  max=38.6ms  p(90)=22.56ms  p(95)=24.56ms
       { expected_response:true }...: avg=18.38ms  min=13.05ms  med=17.37ms  max=38.6ms  p(90)=22.56ms  p(95)=24.56ms
     http_req_failed................: 0.00% ✓ 0                     ✗ 94 
     http_req_receiving.............: avg=596.5µs  min=175.01µs med=496.71µs max=5.23ms  p(90)=806.9µs  p(95)=1.17ms 
     http_req_sending...............: avg=648.42µs min=176.82µs med=475.67µs max=10.65ms p(90)=944.29µs p(95)=1.2ms  
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s      p(90)=0s       p(95)=0s     
     http_req_waiting...............: avg=17.13ms  min=12.24ms  med=16.3ms   max=36.83ms p(90)=20.81ms  p(95)=23.16ms
     http_reqs......................: 94    0.000281/s
     iteration_duration.............: avg=36.19ms  min=23.39ms  med=34.67ms  max=66.03ms p(90)=47.53ms  p(95)=53.04ms
     iterations.....................: 94    0.000281/s
     vus............................: 1     min=1                   max=1
     vus_max........................: 1     min=1                   max=1

time="2023-01-16T08:05:13Z" level=error msg="Aborting k6 in response to signal" sig=terminated